[
    {    
        "title": "QnA Chatbot implementation with semantic search for Custom OpenAI Chatbot and promt-engineering",
        "date": "Dec 15, 2024",
        "description": "This project focuses on developing a custom chatbot designed to analyse and interact with users. The project initially explores datasets to find the most appropriate one for generating insightful and engaging chatbot conversations. It utilizes in-context prompting and a custom dataset to answer user queries and provide relevant information. The project also includes a semantic search engine to enhance the chatbot's performance.",
        "link": "https://github.com/abdel-habib/generative-ai-nanodegree/blob/main/Course%203/project/project.ipynb",
        "image": "./public/images/projects/custom-chatbot.png",
        "image_animated": "./public/images/projects/custom-chatbot.png",
        "status": ""
    },{    
        "title": "Lightweight fine-tuning-Bert for sequence classification using Parameter-Efficient Fine-Tuning",
        "date": "Oct 30, 2024",
        "description": "The primary task of this project is to fine-tune BERT model usisng PEFT technique on an text-label dataset for the task of text classification. This techniques avoids training the model from scratch and optimizes the performance on a specific task.",
        "link": "https://github.com/abdel-habib/generative-ai-nanodegree/blob/main/Course%202/Project/Lightweight-Fine-Tuning-LoRa.ipynb",
        "image": "./public/images/projects/fintunin-bert-lora.png",
        "image_animated": "./public/images/projects/fintunin-bert-lora.png",
        "status": ""
    },{    
        "title": "Automated Mammography Reporting through Image-to-Text Translation",
        "date": "June 26, 2024",
        "description": "The primary task of this project is to design and train a module that facilitates effective communication between the image classifier and the text generator, translating the extracted features into a coherent and clinically useful mammography report. The project underscores the necessity to understand the clinical implications to adequately design the system.",
        "link": "https://github.com/abdel-habib/mmg-clip",
        "image": "./public/images/projects/exam-level-generated-report.png",
        "image_animated": "./public/images/projects/exam-level-generated-report.png",
        "status": ""
    },{    
        "title": "ISIC2019 Skin Lesion Classification & Segmentation",
        "date": "Jan 17, 2024",
        "description": "ISIC2019 skin lesion classification (binary & multi-class) as well as segmentation pipelines using VGG16_BN and visual attention blocks. The project features improving the results found in the literature by implementing an ensemble architecture. This project was developed for 'Computer Aided Diagnosis - CAD' course for MAIA masters program.",
        "link": "https://github.com/abdel-habib/ISIC2019-skin-lesion-classification-segmentation",
        "image": "./public/images/projects/isic2019.png",
        "image_animated": "./public/images/projects/isic2019.png",
        "status": ""
    },{    
        "title": "IBSR 2018 Brain Tissue Segmentation",
        "date": "Jan 12, 2024",
        "description": "Brain tissue (WM, GM, CSF) segmentation using both multi-atlas and nnUNet approaches. This project was developed for a course titled 'Medical Image Segmentation and Applications' - MISA under MAIA master program.",
        "link": "https://github.com/abdel-habib/IBSR18-brain-tissue-segmentation",
        "image": "./public/images/projects/ibsr-seg.png",
        "image_animated": "./public/images/projects/ibsr-seg.gif",
        "status": ""
    },{    
        "title": "COPD-gene Computed Tomography Registration",
        "date": "Jan 5, 2024",
        "description": "Registration of image sets and reference data of inspiratory and expiatory breath-hold CT image pairs acquired from the National Heart Lung Blood Institute COPDgene study archive. This project was developed for a course titled 'Medical Image Registration and Applications' - MIRA under MAIA master program.",
        "link": "https://github.com/abdel-habib/COPDgene-CT-registration",
        "image": "./public/images/projects/copd-reg.png",
        "image_animated": "./public/images/projects/copd-reg.png",
        "status": ""
    },{    
        "title": "Brain Tissue Segmentation using Expectation Maximization and Probabilistic Atlases",
        "date": "Nov 20, 2023",
        "description": "This is an implementation for Expectation Maximization (EM) algorithm using both intinsity and position information obtained from atlases. It utilises both probabilistic and MNITemplate atlases to segment the three brain tissues (WM, GM, CSF) using different initialization methods (random, k-means, tissue model only, atlas only, tissue-model-atlas).",
        "link": "https://github.com/abdel-habib/medical-image-segmentation-and-applications/tree/main/Lab%203",
        "image": "./public/images/projects/em-seg-lab.png",
        "image_animated": "./public/images/projects/em-seg-lab-animation.gif",
        "status": ""
    },{    
        "title": "U-Net PyTorch Implementation for Medical Image Segmentation",
        "date": "Aug 20, 2023",
        "description": "This is an end-to-end implementation for UNet architecture using PyTorch for medical image segmentation. It consists of model training and testing, as well as dataset pre-processing that can be used on any dataset and excutable using a command line. The project has been tested on multiple medical images datasets.",
        "link": "https://github.com/abdel-habib//unet-pytorch-segmentation",
        "image": "./public/images/projects/unet-pytorch-implementation.jpg",
        "image_animated": "./public/images/projects/unet-pytorch-implementation.jpg",
        "status": ""
    },{    
        "title": "micrograd - a compact autograd engine that operates with scalar values and a neural network library",
        "date": "Aug 2, 2023",
        "description": "This is an open-source project to develop a machine learning framework encompassing a minimalistic scalar-valued autograd engine and a simple neural network library. The neural network library will offer a wide range of pre-implemented layers, activation and loss functions.",
        "link": "https://github.com/abdel-habib//micrograd",
        "image": "./public/images/projects/micrograd.png",
        "image_animated": "./public/images/projects/micrograd-animated.png",
        "status": ""
    },
    {    
        "title": "Breast Mass Detection and Segmentation Using Multi-scale Morphological Sifting and K-Means Clustering",
        "date": "June 19, 2023",
        "description": "This project was implemented for mammographic mass detection and segmentation using a multi-scale morphological sifting approach integrated with a mean shift filter, k-means, and post-processing that detects and segments masses. This implementation was evaluated on InBreast dataset and was able to segment mass lesions with a sensitivity of 76.92%.",
        "link": "https://github.com/abdel-habib//breast-mass-detection-and-segmentation-using-multi-scale-morphological-sifting-and-kmeans-clustering",
        "image": "./public/images/projects/breast-mass-segmentation.png",
        "image_animated": "./public/images/projects/breast-mass-segmentation-animated.png"
    },
    {    
        "title": "Magnification Specific Breast Histopathology Image Classification Using Machine and Deep Learning",
        "date": "June 12, 2023",
        "description": "This project was implemented for an image classification task for breast cancer into benign and malignant classes from eight different subclasses. The BreaKHis dataset is utilized in this project to compare different approaches, using deep learning DenseNet architecture with transfer learning, and various machine learning algorithms (SVM, RF, and KNN).",
        "link": "https://github.com/abdel-habib//magnification-specific-breast-histopathology-image-classification-using-machine-and-deep-learning",
        "image": "./public/images/projects/magnification-specific-breast-histopathology-image-classification-using-machine-and-deep-learning.jpg",
        "image_animated": "./public/images/projects/magnification-specific-breast-histopathology-image-classification-using-machine-and-deep-learning-zoomed.jpg"
    },
    {    
        "title": "Alzheimer Disease Classification using MRIs and Gene Expression Data",
        "date": "June 11, 2023",
        "description": "This project was implemented for developing three binary classifiers with various feature selection and validation methods for classifying between AD (macro-)stages, which are CTL, MCI, and AD. The dataset used contained both MRI and GE features for various number of patients. The final result was evaluated using AUC and MCC metrics.",
        "link": "https://github.com/abdel-habib//alzheimer-disease-classification-using-MRIs-and-gene-expression-data",
        "image": "./public/images/projects/alzheimer-disease-classification.png",
        "image_animated": "./public/images/projects/alzheimer-disease-classification.png"
    },
    {    
        "title": "Regularized General Eigenvalue Classifier (ReGEC)",
        "date": "Mar 29, 2023",
        "description": "The project was aimed to implement ReGEC algorithm from scratch using R-programming language using different kernel types (linear and gaussian). The performance was evaluated using 4 datasets, which are Cleveland Heart Disease, Pima Indians, Breast Cancer, and German Datasets. The overall performance was significantly close or higher than the results reported in the paper.",
        "link": "https://github.com/abdel-habib//Regularized-General-Eigenvalue-Classifier-ReGEC",
        "image": "./public/images/projects/svm.png",
        "image_animated": "./public/images/projects/svm.png"
    },
    {    
        "title": "Healthcare AI: End-to-end AI solution for all of your use cases",
        "date": "Mar 21, 2023",
        "description": "The project was aimed to develop an end-to-end solution for data storage, model training and deployment that doesn't require any coding knowledge from the user. The platform allows the user to create an account, create project workspaces, upload image data, train an image classification model with a single button click, and deploy the trained model using an inference API.",
        "link": "https://www.doctoroncall.com.my/healthcare-ai",
        "image": "./public/images/projects/healthcare-ai-cropped.png",
        "image_animated": "./public/images/projects/healthcare-ai.png"
    },
    {    
        "title": "Motion Compensated Pulse Rate Estimation",
        "date": "Oct 13, 2021",
        "description": "The project was aimed to build a regression model to predict the estimated hospitalization time for a patient in order to help select/filter patients and evaluate model bias and uncertainty. Perform exploratory data analysis in order to identify the dataset level and perform feature selection, and build necessary categorical and numerical feature transformations.",
        "link": "https://github.com/abdel-habib//AI-for-Healthcare-Nanodegree/tree/main/Project%204",
        "image": "./public/images/projects/ppg-mechanics.png",
        "image_animated": "./public/images/projects/ppg-mechanics.png"
    },
    {    
        "title": "Hippocampal Volume Quantification in Alzheimer's Progression",
        "date": "Sep 15, 2021",
        "description": "The project was aimed to build an end-to-end AI system which features a machine learning algorithm to measure the hippocampal volumes by training a U-net based segmentation model, integrates the system into a clinical-grade viewer and automatically measures hippocampal volumes of new patients, and generate reports based on the algorithm output.",
        "link": "https://github.com/abdel-habib//AI-for-Healthcare-Nanodegree/tree/main/Project%202/Hippocampal%20Volume%20Quantification%20in%20Alzheimer's%20Progression",
        "image": "./public/images/projects/hippocampus-mri.jpg",
        "image_animated": "./public/images/projects/hippocampus-animated.gif"
    },
    {    
        "title": "Pneumonia Detection from Chest X-Rays",
        "date": "Sep 14, 2021",
        "description": "The project was aimed to apply It also includes exploratory data analysis (EDA) process on a chest x-rays dataset, train a model that can predict the presence of pneumonia with human radiologist-level accuracy that can be prepared for submission to the FDA for 510(k) clearance as software as a medical device, as well as clinical workflow integration.",
        "link": "https://github.com/abdel-habib//AI-for-Healthcare-Nanodegree/tree/main/Project%201/Pneumonia%20Detection%20From%20Chest%20X-Rays%20-%20Solved",
        "image": "./public/images/projects/pneumonia-detection.png",
        "image_animated": "./public/images/projects/pneumonia-detection-animated.gif"
    },
    {    
        "title": "Skin Cancer Classification",
        "date": "",
        "description": "The project was aimed to explore, build, train and deploy a machine learning imag classification model using a pre-trained MobileNet model to classify between seven different image classes that represent skin lesions. The model was trained using HAM10000 dataset and the project was deployed to production as a web application by also utilizing cloud services (AWS)",
        "link": "",
        "image": "./public/images/projects/skin-lesion-classification.png",
        "image_animated": "./public/images/projects/skin-lesion-classification.png",
        "status": ""
    },
    {    
        "title": "Lung and Colon Cancer Histopathological Images",
        "date": "",
        "description": "The project was aimed to explore a daaset of 25,000 histopathological images of 5 classes, build an image classification model and evaluate it using various evaluation metrics. The images were generated from an original sample of HIPAA compliant and validated sources, consisting of 750 total images of lung tissue, and 500 total images of colon tissue, and augmented to 25,000.",
        "link": "https://github.com/abdel-habib//lung-and-colon-cancer-histopathological-images-kaggle",
        "image": "./public/images/projects/histopathological-dataset.png",
        "image_animated": "./public/images/projects/histopathological-dataset.png",
        "status": ""
    }
]